# 1. Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

spisok = [123, "Hello", 55.9, True]
for i in spisok:
    print(i, type(i))

print(spisok)
